ESP-WORKS/TTGO-VGA32-C64/sdkconfig.defaults
# Convertido do sdkconfig original (IDF 3.3).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_FREERTOS_HZ=100
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- DIAGNOSTICO ---------------------------------------------------------
# Watchdogs LIGADOS de proposito: um travamento vira backtrace em vez de
# silencio. Depois que o boot estiver limpo, desligue os dois de novo,
# porque o laco do C64 (oneRasterLine) nao da yield.
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
CONFIG_COMPILER_STACK_CHECK=y
# main_task chama setup() inteiro; o default de 3584 e' curto.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
